adifiak/PSoC_AntennaRotator/Workspace01/AntennaRotator.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "SW_UP_Pin_aliases.h"
#include "SW_UP_Pin.h"
#include "LED_Pin_aliases.h"
#include "LED_Pin.h"
#include "SW_DOWN_Pin_aliases.h"
#include "SW_DOWN_Pin.h"
#include "SW_LEFT_Pin_aliases.h"
#include "SW_LEFT_Pin.h"
#include "SW_RIGHT_Pin_aliases.h"
#include "SW_RIGHT_Pin.h"
#include "UART.h"
#include "SDA_1_aliases.h"
#include "SDA_1.h"
#include "SCL_1_aliases.h"
#include "SCL_1.h"
#include "I2C_OLED.h"
#include "I2C_OLED_PVT.h"
#include "ADC_SAR_1.h"
#include "ADC_SAR_2.h"
#include "Analog_Pin_1_aliases.h"
#include "Analog_Pin_1.h"
#include "Analog_Pin_2_aliases.h"
#include "Analog_Pin_2.h"
#include "UART_IntClock.h"
#include "ADC_SAR_1_IRQ.h"
#include "ADC_SAR_1_theACLK.h"
#include "ADC_SAR_1_ExtVref_aliases.h"
#include "ADC_SAR_1_ExtVref.h"
#include "ADC_SAR_2_IRQ.h"
#include "ADC_SAR_2_theACLK.h"
#include "ADC_SAR_2_ExtVref_aliases.h"
#include "ADC_SAR_2_ExtVref.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

